Importing an existing brand (particular one that wasn't created by Terraform) succeeds, however I think this behavior makes a problem:

>> When a specific resource already exists but terraform does not know about it, terraform will attempt to create it, which causes the 409 conflict failure.

Let's say you want to change the `support_email` of an existing brand.

1) You import the brand
```
% terraform import google_iap_brand.existingbrand projects/myproject/brands/1234567890
google_iap_brand.existingbrand: Importing from ID "projects/myproject/brands/1234567890"...
google_iap_brand.existingbrand: Import prepared!
  Prepared google_iap_brand for import
google_iap_brand.existingbrand: Refreshing state... [id=projects/myproject/brands/1234567890]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.
```

2) Run `terraform plan` just to see if there are any diffs (there shouldn't)
```
------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
```

3) Make changes in your `support_email` field and apply:

```
Terraform will perform the following actions:

  # google_iap_brand.existingbrand must be replaced
-/+ resource "google_iap_brand" "existingbrand" {
        application_title = "retool"
      ~ id                = " projects/myproject/brands/1234567890" -> (known after apply)
      ~ name              = " projects/myproject/brands/1234567890" -> (known after apply)
      ~ org_internal_only = true -> (known after apply)
        project           = "myproject"
      ~ support_email     = "old@email.com" -> "new@email.com" # forces replacement

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_iap_brand.existingbrand: Destroying... [id= projects/myproject/brands/1234567890]
google_iap_brand.existingbrand Destruction complete after 0s
google_iap_brand.existingbrand: Creating...

Error: Error creating Brand: googleapi: Error 409: Requested entity already exists

  on ..iap.tf line 3, in resource "google_iap_brand" "existingbrand":
   3: resource "google_iap_brand" "existingbrandl" {
```

This is getting the `409` like we saw in @minac 's debug output as well.